hachi7574/CaPilot/Firmware/demos/audio_demo/sdkconfig.defaults
# audio_demo sdkconfig defaults
# Audio: I2C + I2S + ES7210/ES8311, no LCD/Touch/LVGL

CONFIG_IDF_TARGET="esp32s3"

# Disable BSP optional features
CONFIG_CAPILOT_BSP_TOUCH_ENABLE=n
CONFIG_CAPILOT_BSP_LVGL_ENABLE=n

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM (Octal SPIRAM 80MHz)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# CPU 240MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Cache
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
